"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.


"""

year = input("Введите год: ")
month = input("Введите номер месяца: ")
day = input("Введите число месяца: ")
print(f"Сегодняшняя дата:  {day}.{month}.{year}")
